ryankurte/efm32-base/emdrv/dmadrv/inc/dmadrv.h
/// Data size of one LDMA transfer item.
typedef enum {
  dmadrvDataSize1 = ldmaCtrlSizeByte, ///< Byte
  dmadrvDataSize2 = ldmaCtrlSizeHalf, ///< Halfword
  dmadrvDataSize4 = ldmaCtrlSizeWord  ///< Word
} DMADRV_DataSize_t;

#endif /* defined( LDMA_PRESENT ) && ( LDMA_COUNT == 1 ) */

Ecode_t DMADRV_AllocateChannel(unsigned int *channelId, void *capabilities);
Ecode_t DMADRV_DeInit(void);
Ecode_t DMADRV_FreeChannel(unsigned int channelId);
Ecode_t DMADRV_Init(void);

#if !defined(EMDRV_DMADRV_USE_NATIVE_API) || defined(DOXY_DOC_ONLY)
Ecode_t DMADRV_MemoryPeripheral(unsigned int          channelId,
                                DMADRV_PeripheralSignal_t peripheralSignal,
                                void                  *dst,
                                void                  *src,
                                bool                  srcInc,
                                int                   len,
                                DMADRV_DataSize_t     size,
                                DMADRV_Callback_t     callback,
                                void                  *cbUserParam);
Ecode_t DMADRV_PeripheralMemory(unsigned int          channelId,
                                DMADRV_PeripheralSignal_t peripheralSignal,
                                void                  *dst,
                                void                  *src,
                                bool                  dstInc,
                                int                   len,
                                DMADRV_DataSize_t     size,
                                DMADRV_Callback_t     callback,
                                void                  *cbUserParam);
Ecode_t DMADRV_MemoryPeripheralPingPong(unsigned int          channelId,
                                        DMADRV_PeripheralSignal_t peripheralSignal,
                                        void                  *dst,
                                        void                  *src0,
                                        void                  *src1,
                                        bool                  srcInc,
                                        int                   len,
                                        DMADRV_DataSize_t     size,
                                        DMADRV_Callback_t     callback,
                                        void                  *cbUserParam);
Ecode_t DMADRV_PeripheralMemoryPingPong(unsigned int          channelId,
                                        DMADRV_PeripheralSignal_t peripheralSignal,
                                        void                  *dst0,
                                        void                  *dst1,
                                        void                  *src,
                                        bool                  dstInc,
                                        int                   len,
                                        DMADRV_DataSize_t     size,
                                        DMADRV_Callback_t     callback,
                                        void                  *cbUserParam);
#endif

#if defined(EMDRV_DMADRV_LDMA) && defined(EMDRV_DMADRV_USE_NATIVE_API)

Ecode_t DMADRV_LdmaStartTransfer(
  int                channelId,
  LDMA_TransferCfg_t *transfer,
  LDMA_Descriptor_t  *descriptor,
  DMADRV_Callback_t  callback,
  void               *cbUserParam);

#endif /* !defined( EMDRV_DMADRV_USE_NATIVE_API ) */

Ecode_t DMADRV_PauseTransfer(unsigned int channelId);
Ecode_t DMADRV_ResumeTransfer(unsigned int channelId);
Ecode_t DMADRV_StopTransfer(unsigned int channelId);
Ecode_t DMADRV_TransferActive(unsigned int channelId, bool *active);
Ecode_t DMADRV_TransferCompletePending(unsigned int channelId, bool *pending);
Ecode_t DMADRV_TransferDone(unsigned int channelId, bool *done);
Ecode_t DMADRV_TransferRemainingCount(unsigned int channelId,
                                      int *remaining);

/** @} (end addtogroup DMADRV) */
/** @} (end addtogroup emdrv) */

#ifdef __cplusplus
}
#endif

#endif /* __SILICON_LABS_DMADRV_H__ */
